<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [8]:
import pandas as pd
import psycopg2

In [9]:
# вставьте сюда параметры подключения из юнита 1. Работа с базой данных из Python 
DBNAME = 'project_sql'
USER = 'skillfactory'
PASSWORD = 'cCkxxLVrDE8EbvjueeMedPKt'
HOST = '84.201.134.129'
PORT = 5432

In [10]:
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
)

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [4]:
# текст запроса
query_3_1 = f'''SELECT count(*) cnt1 FROM public.vacancies 
'''

In [5]:
# результат запроса
df = pd.read_sql_query(query_3_1, connection)
df

C:\Users\Glavatskih-DE\AppData\Local\Temp\ipykernel_15424\1114379196.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_1, connection)

    cnt1
0  49197

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [6]:
# текст запроса
query_3_2 = f'''SELECT count(*) cnt1 FROM public.employers
'''

In [8]:
# результат запроса
df = pd.read_sql_query(query_3_2, connection)
df

C:\Users\Glavatskih-DE\AppData\Local\Temp\ipykernel_16896\3062646138.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_2, connection)

    cnt1
0  23501

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [9]:
# текст запроса
query_3_3 = f'''SELECT count(*) cnt1 FROM public.areas
'''

In [10]:
# результат запроса
df = pd.read_sql_query(query_3_3, connection)
df

C:\Users\Glavatskih-DE\AppData\Local\Temp\ipykernel_16896\928149064.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_3, connection)

   cnt1
0  1362

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [5]:
# текст запроса
query_3_4 = f'''SELECT count(*) cnt1 FROM public.industries
'''

In [6]:
# результат запроса
df = pd.read_sql_query(query_3_4, connection)
df

C:\Users\Glavatskih-DE\AppData\Local\Temp\ipykernel_18860\2101691108.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_4, connection)

   cnt1
0   294

***

In [ ]:
# выводы по предварительному анализу данных
Даже не знаю что и сказать, всего очень много ))

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [7]:
# текст запроса
query_4_1 = f'''SELECT 
  a1.name,
  count(*) cnt1
FROM public.vacancies v1
  inner join public.areas a1 on a1.id = v1.area_id  
group by a1.name
order by count(*) desc
'''

In [8]:
# результат запроса
df = pd.read_sql_query(query_4_1, connection)
df

C:\Users\Glavatskih-DE\AppData\Local\Temp\ipykernel_18860\2457173557.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_1, connection)

                name  cnt1
0             Москва  5333
1    Санкт-Петербург  2851
2              Минск  2112
3        Новосибирск  2006
4             Алматы  1892
..               ...   ...
764       Тарко-Сале     1
765    Новоаннинский     1
766            Бирск     1
767           Сасово     1
768             Анна     1

[769 rows x 2 columns]

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [9]:
# текст запроса
query_4_2 = f'''SELECT count(*)
FROM public.vacancies v1
where v1.salary_from is not null or 
      v1.salary_to is not NULL

'''

In [10]:
# результат запроса
df = pd.read_sql_query(query_4_2, connection)
df

C:\Users\Glavatskih-DE\AppData\Local\Temp\ipykernel_18860\970655580.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_2, connection)

   count
0  24073

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [11]:
# текст запроса
query_4_3 = f'''SELECT round(avg(v1.salary_from)) zp_from,
       round(avg(v1.salary_to)) zp_to
FROM public.vacancies v1
'''

In [12]:
# результат запроса
df = pd.read_sql_query(query_4_3, connection)
df

C:\Users\Glavatskih-DE\AppData\Local\Temp\ipykernel_18860\2500607024.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_3, connection)

   zp_from     zp_to
0  71065.0  110537.0

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [13]:
# текст запроса
query_4_4 = f'''SELECT v1.schedule , v1.employment ,
       count(*)
FROM public.vacancies v1
group by v1.schedule , v1.employment
order by count(*) desc

'''

In [14]:
# результат запроса
df = pd.read_sql_query(query_4_4, connection)
df

C:\Users\Glavatskih-DE\AppData\Local\Temp\ipykernel_18860\2022935265.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_4, connection)

            schedule           employment  count
0        Полный день     Полная занятость  35367
1   Удаленная работа     Полная занятость   7802
2      Гибкий график     Полная занятость   1593
3   Удаленная работа  Частичная занятость   1312
4     Сменный график     Полная занятость    940
5        Полный день           Стажировка    569
6     Вахтовый метод     Полная занятость    367
7        Полный день  Частичная занятость    347
8      Гибкий график  Частичная занятость    312
9        Полный день     Проектная работа    141
10  Удаленная работа     Проектная работа    133
11     Гибкий график           Стажировка    116
12    Сменный график  Частичная занятость    101
13  Удаленная работа           Стажировка     64
14     Гибкий график     Проектная работа     18
15    Сменный график           Стажировка     12
16    Вахтовый метод     Проектная работа      2
17    Сменный график     Проектная работа      1

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [15]:
# текст запроса
query_4_5 = f'''SELECT v1.experience ,
       count(*)
FROM public.vacancies v1
group by v1.experience
order by count(*)

'''

In [16]:
# результат запроса
df = pd.read_sql_query(query_4_5, connection)
df

C:\Users\Glavatskih-DE\AppData\Local\Temp\ipykernel_18860\2316260449.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_5, connection)

           experience  count
0         Более 6 лет   1337
1           Нет опыта   7197
2       От 3 до 6 лет  14511
3  От 1 года до 3 лет  26152

***

In [ ]:
# выводы по детальному анализу вакансий
Больше всего вакансий в Москве
Преобладающее сочетание график/тип трудоустройства - "Полный день/Полная занятость"
Самый популярный опыт работы - "От 1 года до 3 лет"

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [17]:
# текст запроса
query_5_1 = f'''SELECT e1."name"  ,
       count(*)
FROM public.vacancies v1
  inner join public.employers e1 on  e1.id = v1.employer_id 
group by e1."name"
order by count(*) desc
limit 5

'''

In [18]:
# результат запроса
df = pd.read_sql_query(query_5_1, connection)
df

C:\Users\Glavatskih-DE\AppData\Local\Temp\ipykernel_18860\3834399874.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_1, connection)

            name  count
0         Яндекс   1933
1     Ростелеком    491
2       Тинькофф    444
3           СБЕР    428
4  Газпром нефть    331

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [8]:
# текст запроса
query_5_2 = f'''SELECT a1."name" ,
       v2.cnt1 as cnt_vac,
       e2.cnt1 as cnt_emp
FROM public.areas a1
  left join (select v1.area_id, count(*) cnt1 from public.vacancies v1 group by v1.area_id) v2
    on v2.area_id = a1.id
  left join (select e1.area, count(1) cnt1 from public.employers e1 group by e1.area) e2 
    on  e2.area = a1.id
where 
  v2.cnt1 is null 
order by e2.cnt1 desc nulls last
limit 10

'''

In [9]:
# результат запроса
df = pd.read_sql_query(query_5_2, connection)
df

C:\Users\Glavatskih-DE\AppData\Local\Temp\ipykernel_15424\2250345976.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_2, connection)

                    name cnt_vac  cnt_emp
0                 Россия    None      410
1              Казахстан    None      207
2     Московская область    None       75
3     Краснодарский край    None       19
4               Беларусь    None       18
5     Ростовская область    None       18
6            Азербайджан    None       17
7  Нижегородская область    None       16
8   Республика Татарстан    None       16
9             Узбекистан    None       15

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [6]:
# текст запроса
query_5_3 = f'''select emp_name, count(*) as cnt_reg
from (
  SELECT distinct e1."name" as emp_name , v1.area_id 
  FROM public.vacancies v1
    inner join public.employers e1 on  e1.id = v1.employer_id 
    ) q1
group by emp_name
order by count(*) desc

'''

In [7]:
# результат запроса
df = pd.read_sql_query(query_5_3, connection)
df

C:\Users\Glavatskih-DE\AppData\Local\Temp\ipykernel_15424\201667002.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_3, connection)

                                                emp_name  cnt_reg
0                                                 Яндекс      181
1                                             Ростелеком      152
2                                             Спецремонт      116
3                                 Поляков Денис Иванович       88
4                                              ООО ЕФИН        71
...                                                  ...      ...
14761                                         Интеркросс        1
14762                                      Русская дымка        1
14763  Автономная некоммерческая организация Московск...        1
14764                 Транспортный холдинг города Алматы        1
14765                                        СептикГрупп        1

[14766 rows x 2 columns]

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [10]:
# текст запроса
query_5_4 = f'''select count(*) as cnt1
from public.employers e1
  left join public.employers_industries i1 on i1.employer_id = e1.id 
where i1.employer_id is null

'''

In [11]:
# результат запроса
df = pd.read_sql_query(query_5_4, connection)
df

C:\Users\Glavatskih-DE\AppData\Local\Temp\ipykernel_15424\3493105328.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_4, connection)

   cnt1
0  8419

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [12]:
# текст запроса
query_5_5 = f'''select 
  e1."name" ,
  count(*) as ind_cnt
from public.employers e1
  left join public.employers_industries i1 on i1.employer_id = e1.id 
group by e1."name" 
having count(*) = 4
order by e1."name" 
offset 2 limit 1

'''

In [13]:
# результат запроса
df = pd.read_sql_query(query_5_5, connection)
df

C:\Users\Glavatskih-DE\AppData\Local\Temp\ipykernel_15424\388711819.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_5, connection)

   name  ind_cnt
0  2ГИС        4

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [4]:
# текст запроса
query_5_6 = f'''select 
  count(*) as ind_cnt
from public.employers e1
  left join public.employers_industries i1 on i1.employer_id = e1.id 
  left join public.industries i2 on i2.id  = i1.industry_id 
where
  i2."name" = 'Разработка программного обеспечения'

'''

In [5]:
# результат запроса
df = pd.read_sql_query(query_5_6, connection)
df

C:\Users\Glavatskih-DE\AppData\Local\Temp\ipykernel_3184\821628714.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_6, connection)

   ind_cnt
0     3553

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8). 

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

In [ ]:
# код для получения списка городов-милионников

In [ ]:
# текст запроса
query_5_7 = f'''
'''

In [ ]:
# результат запроса
df = pd.read_sql_query(query_5_7, connection)
df

***

In [ ]:
# выводы по анализу работодателей
Яндекс - самый активный работодатель как по кол-ву вакансий, так и по региональному охвату.
Разработка программного обеспечения является весьма распространенной сферой деятельности.

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [6]:
# текст запроса
query_6_1 = f'''select count(*)
FROM public.vacancies v1
where
  upper(v1."name") like  '%ДАНН%' or
  upper(v1."name") like  '%DATA%'

'''

In [7]:
# результат запроса
df = pd.read_sql_query(query_6_1, connection)
df

C:\Users\Glavatskih-DE\AppData\Local\Temp\ipykernel_3184\366702258.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_1, connection)

   count
0   1771

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [4]:
# текст запроса
query_6_2 = f'''select count(*) cnt1
FROM public.vacancies v1
where (
 lower(v1."name") like '%data scientist%' or
 lower(v1."name") like '%data science%' or
 lower(v1."name") like '%исследователь данных%' or
 (v1."name" like '%ML%' and v1."name" not like '%HTML%' ) or   --(здесь не нужно брать вакансии по HTML)
 lower(v1."name") like '%machine learning%' or
 lower(v1."name") like '%машинн%обучен%' 
  ) and (
    lower(v1."name") like '%junior%' or 
    v1.experience  = 'Нет опыта' or
    v1.employment = 'Стажировка'
  )
  

'''

In [5]:
# результат запроса
df = pd.read_sql_query(query_6_2, connection)
df

C:\Users\Glavatskih-DE\AppData\Local\Temp\ipykernel_12064\2267038862.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_2, connection)

   cnt1
0    51

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [6]:
# текст запроса
query_6_3 = f'''select count(*) cnt1
FROM public.vacancies v1
where (
 lower(v1."name") like '%data scientist%' or
 lower(v1."name") like '%data science%' or
 lower(v1."name") like '%исследователь данных%' or
 (v1."name" like '%ML%' and v1."name" not like '%HTML%' ) or   --(здесь не нужно брать вакансии по HTML)
 lower(v1."name") like '%machine learning%' or
 lower(v1."name") like '%машинн%обучен%' 
  ) and (
    lower(v1.key_skills) like '%postgres%' or 
    v1.key_skills like '%SQL%' 
  )

'''

In [7]:
# результат запроса
df = pd.read_sql_query(query_6_3, connection)
df

C:\Users\Glavatskih-DE\AppData\Local\Temp\ipykernel_12064\3794299702.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_3, connection)

   cnt1
0   201

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [4]:
# текст запроса
query_6_4 = f'''select count(*) cnt1
FROM public.vacancies v1
where (
 lower(v1."name") like '%data scientist%' or
 lower(v1."name") like '%data science%' or
 lower(v1."name") like '%исследователь данных%' or
 (v1."name" like '%ML%' and v1."name" not like '%HTML%' ) or   --(здесь не нужно брать вакансии по HTML)
 lower(v1."name") like '%machine learning%' or
 lower(v1."name") like '%машинн%обучен%' 
  ) and (
    v1.key_skills like '%Python%' 
  )

'''

In [5]:
# результат запроса
df = pd.read_sql_query(query_6_4, connection)
df

C:\Users\Glavatskih-DE\AppData\Local\Temp\ipykernel_8928\4264665179.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_4, connection)

   cnt1
0   351

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [4]:
# текст запроса
query_6_5 = f'''select 
  avg(length( v1.key_skills ) - length(replace( v1.key_skills, chr(9), '' )) + 1)  skil1
FROM public.vacancies v1
where (
 lower(v1."name") like '%data scientist%' or
 lower(v1."name") like '%data science%' or
 lower(v1."name") like '%исследователь данных%' or
 (v1."name" like '%ML%' and v1."name" not like '%HTML%' ) or   --(здесь не нужно брать вакансии по HTML)
 lower(v1."name") like '%machine learning%' or
 lower(v1."name") like '%машинн%обучен%' 
  ) 

'''

In [5]:
# результат запроса
df = pd.read_sql_query(query_6_5, connection)
df

C:\Users\Glavatskih-DE\AppData\Local\Temp\ipykernel_17612\3654210517.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_5, connection)

      skil1
0  6.406032

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [11]:
# текст запроса
query_6_6 = f'''select 
  v1.experience ,
    avg((coalesce(v1.salary_from, v1.salary_to) + coalesce(v1.salary_to, v1.salary_from))/2)   zp1
FROM public.vacancies v1
where (
 lower(v1."name") like '%data scientist%' or
 lower(v1."name") like '%data science%' or
 lower(v1."name") like '%исследователь данных%' or
 (v1."name" like '%ML%' and v1."name" not like '%HTML%' ) or   --(здесь не нужно брать вакансии по HTML)
 lower(v1."name") like '%machine learning%' or
 lower(v1."name") like '%машинн%обучен%' 
  ) and (
 v1.salary_from  is not null or 
 v1.salary_to is not NULL
  )
group by v1.experience
order by 2 desc

'''

In [12]:
# результат запроса
df = pd.read_sql_query(query_6_6, connection)
df

C:\Users\Glavatskih-DE\AppData\Local\Temp\ipykernel_17612\519194770.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_6, connection)

           experience            zp1
0       От 3 до 6 лет  243114.666667
1  От 1 года до 3 лет  139674.750000
2           Нет опыта   74642.857143

***

In [ ]:
# выводы по предметному анализу
Дата-сайентист - очень востребованная и высокооплачиваемая профессия. 
Разработка на Python - очень важный навык, почти всегда необходимый дата-сайентисту.

# Общий вывод по проекту

In [ ]:
# подведем итог исследования, обобщите выводы
# здесь можно (это будет плюсом) провести дополнительные исследования данных, сделать прогнозы, продумать варианты продолжения исследования
Анализ данных - важнейший этап, предшествующий построению модели машинного обучения.
По правде сказать никогда не любил делать выводы ))